app/Http/Controllers/HomeController.php

    public function security_center()
    {
        $this->authorize('viewAny', Role::class);
        $roles = Role::all();
        $permissions = Permission::all();
---
select * from `roles`
select * from `permissions`