app/Http/Controllers/PermissionController.php

    public function index()
    {
        $this->authorize('viewAny', Permission::class);
        return $permissions = Permission::all();
---
select * from `permissions`