app/Http/Controllers/RoleController.php

    public function index()
    {
        $this->authorize('viewAny', Role::class);
        return Role::all();
---
select * from `roles`